# Delete and Insert Functions

## Insert

In [20]:
import pandas as pd
var = pd.DataFrame({'A':[1,2,3,4,5],'B':[9,8,7,6,5]})
var

   A  B
0  1  9
1  2  8
2  3  7
3  4  6
4  5  5

In [22]:
var.insert(1,'python',var['A'])  # indexno. position&name , data
var

   A  python  B
0  1       1  9
1  2       2  8
2  3       3  7
3  4       4  6
4  5       5  5

In [26]:
var.insert(1,'python_1',[11,12,13,14,15])  # indexno. position&name , data
var

   A  python_1  python  B
0  1        11       1  9
1  2        12       2  8
2  3        13       3  7
3  4        14       4  6
4  5        15       5  5

In [28]:
var['python_23'] = var['A'][:3]
var

   A  python_1  python  B  python_23
0  1        11       1  9        1.0
1  2        12       2  8        2.0
2  3        13       3  7        3.0
3  4        14       4  6        NaN
4  5        15       5  5        NaN

## Delete

In [31]:
var2=var.pop('B')
var2

0    9
1    8
2    7
3    6
4    5
Name: B, dtype: int64

In [43]:
var

   A  python  python_23
0  1       1        1.0
1  2       2        2.0
2  3       3        3.0
3  4       4        NaN
4  5       5        NaN

In [47]:
del var['python']
var

   A  python_23
0  1        1.0
1  2        2.0
2  3        3.0
3  4        NaN
4  5        NaN